src/main/java/ru/vk/itmo/test/proninvalentin/reports/stage2/wrk/put/put_70000rps_8thread_200channels-improvedCorePool.txt
wrk -d 2m -t 8 -c 200 -R 70000 -s put.lua -L  http://localhost:8080/v0/entry
Running 2m test @ http://localhost:8080/v0/entry
  8 threads and 200 connections
  Thread calibration: mean lat.: 1.296ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.334ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.346ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.333ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.332ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.319ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.325ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.326ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34ms  771.95us  28.42ms   76.96%
    Req/Sec     9.22k   742.65    15.89k    72.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.70ms
 90.000%    2.23ms
 99.000%    3.62ms
 99.900%    6.82ms
 99.990%   16.26ms
 99.999%   23.82ms
100.000%   28.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.028     0.000000            1         1.00
       0.551     0.100000       771380         1.11
       0.747     0.200000      1540182         1.25
       0.913     0.300000      2307685         1.43
       1.072     0.400000      3079044         1.67
       1.231     0.500000      3845812         2.00
       1.314     0.550000      4233715         2.22
       1.399     0.600000      4618054         2.50
       1.489     0.650000      5000301         2.86
       1.588     0.700000      5385827         3.33
       1.699     0.750000      5768962         4.00
       1.762     0.775000      5962303         4.44
       1.831     0.800000      6154512         5.00
       1.909     0.825000      6346854         5.71
       1.998     0.850000      6538329         6.67
       2.103     0.875000      6732021         8.00
       2.161     0.887500      6826354         8.89
       2.227     0.900000      6923404        10.00
       2.301     0.912500      7020480        11.43
       2.383     0.925000      7114589        13.33
       2.481     0.937500      7210702        16.00
       2.539     0.943750      7259819        17.78
       2.601     0.950000      7307084        20.00
       2.673     0.956250      7355709        22.86
       2.757     0.962500      7403863        26.67
       2.857     0.968750      7451380        32.00
       2.917     0.971875      7475081        35.56
       2.989     0.975000      7499534        40.00
       3.069     0.978125      7523048        45.71
       3.169     0.981250      7547541        53.33
       3.289     0.984375      7571125        64.00
       3.365     0.985938      7583350        71.11
       3.451     0.987500      7595315        80.00
       3.551     0.989062      7607235        91.43
       3.675     0.990625      7619341       106.67
       3.831     0.992188      7631232       128.00
       3.933     0.992969      7637299       142.22
       4.053     0.993750      7643315       160.00
       4.203     0.994531      7649346       182.86
       4.383     0.995313      7655243       213.33
       4.615     0.996094      7661293       256.00
       4.747     0.996484      7664295       284.44
       4.907     0.996875      7667316       320.00
       5.091     0.997266      7670306       365.71
       5.315     0.997656      7673289       426.67
       5.579     0.998047      7676276       512.00
       5.747     0.998242      7677796       568.89
       5.951     0.998437      7679297       640.00
       6.187     0.998633      7680795       731.43
       6.487     0.998828      7682303       853.33
       6.875     0.999023      7683788      1024.00
       7.115     0.999121      7684547      1137.78
       7.443     0.999219      7685290      1280.00
       7.863     0.999316      7686043      1462.86
       8.455     0.999414      7686792      1706.67
       9.207     0.999512      7687548      2048.00
       9.663     0.999561      7687917      2275.56
      10.223     0.999609      7688295      2560.00
      10.847     0.999658      7688670      2925.71
      11.535     0.999707      7689043      3413.33
      12.351     0.999756      7689419      4096.00
      12.743     0.999780      7689608      4551.11
      13.303     0.999805      7689794      5120.00
      13.935     0.999829      7689984      5851.43
      14.527     0.999854      7690170      6826.67
      15.311     0.999878      7690357      8192.00
      15.815     0.999890      7690451      9102.22
      16.335     0.999902      7690544     10240.00
      16.831     0.999915      7690640     11702.86
      17.455     0.999927      7690733     13653.33
      18.255     0.999939      7690827     16384.00
      18.575     0.999945      7690874     18204.44
      19.039     0.999951      7690925     20480.00
      19.455     0.999957      7690968     23405.71
      19.951     0.999963      7691015     27306.67
      20.447     0.999969      7691061     32768.00
      20.767     0.999973      7691084     36408.89
      21.183     0.999976      7691108     40960.00
      21.743     0.999979      7691131     46811.43
      22.143     0.999982      7691155     54613.33
      22.575     0.999985      7691178     65536.00
      23.103     0.999986      7691190     72817.78
      23.391     0.999988      7691202     81920.00
      23.695     0.999989      7691214     93622.86
      24.095     0.999991      7691225    109226.67
      24.511     0.999992      7691237    131072.00
      24.639     0.999993      7691243    145635.56
      24.879     0.999994      7691249    163840.00
      25.151     0.999995      7691254    187245.71
      25.311     0.999995      7691260    218453.33
      25.695     0.999996      7691266    262144.00
      25.823     0.999997      7691269    291271.11
      25.887     0.999997      7691272    327680.00
      26.159     0.999997      7691275    374491.43
      26.351     0.999998      7691278    436906.67
      26.383     0.999998      7691281    524288.00
      26.399     0.999998      7691282    582542.22
      26.591     0.999998      7691284    655360.00
      26.815     0.999999      7691285    748982.86
      27.023     0.999999      7691287    873813.33
      27.071     0.999999      7691289   1048576.00
      27.071     0.999999      7691289   1165084.44
      27.151     0.999999      7691290   1310720.00
      27.151     0.999999      7691290   1497965.71
      27.695     0.999999      7691291   1747626.67
      27.855     1.000000      7691292   2097152.00
      27.855     1.000000      7691292   2330168.89
      27.935     1.000000      7691293   2621440.00
      27.935     1.000000      7691293   2995931.43
      27.935     1.000000      7691293   3495253.33
      28.255     1.000000      7691294   4194304.00
      28.255     1.000000      7691294   4660337.78
      28.255     1.000000      7691294   5242880.00
      28.255     1.000000      7691294   5991862.86
      28.255     1.000000      7691294   6990506.67
      28.431     1.000000      7691295   8388608.00
      28.431     1.000000      7691295          inf
#[Mean    =        1.342, StdDeviation   =        0.772]
#[Max     =       28.416, Total count    =      7691295]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8387580 requests in 2.00m, 535.93MB read
Requests/sec:  69896.41
Transfer/sec:      4.47MB